; domain
(define (domain CAMPI)

    ;per risolvere il  problema sono state stilate le seguenti azioni ->
            ;azione per muovere un contadino da un campo ad un altro
            ;azione per muovere un trattore da un campo ad un altro
            ;azione per far salire un contadino a bordo di un trattore
            ;azione per far scendere un contadino dal trattore
            ;azione per equipaggiare un trattore con un aratro
            ;azione per equipaggiare un trattore con un seminatore
            ;azione per rimuovere un equipaggiamento da un trattore 
            ;azione per arare un campo
            ;azione per seminare un campo
            ;azione per innaffiare un campo
            
            
    (:requirements :typing :adl)
    (:types
        aratro seminatore trattore contadino campo
    )
    (:predicates    
                (tractor ?trattore - trattore)
                (tractor-ara ?trattore - trattore)
                (tractor-semina ?trattore - trattore)
                (farmer ?contadino - contadino) 
                (field ?campo - campo)
                (connesso ?campo1 - campo ?campo2 - campo)
                (plow ?aratro - aratro)
                (sower ?seminatore - seminatore)
                (at ?elem - (either trattore aratro contadino seminatore)  ?campo - campo)
                (arato ?campo - campo)
                (seminato ?campo - campo)
                (annaffiato ?campo - campo)
                (attrezzato ?strumento - (either seminatore aratro) ?trattore - trattore)
                (haAttrezzo ?trattore - trattore)
                (aBordo ?contadino - contadino ?trattore - trattore)
    )
    
    ;azione per far muovere un contadino da un campo ad un altro
    (:action moveFarmer
      :parameters (?contadino - contadino ?campo1 - campo ?campo2 - campo)
      :precondition (and
                       (farmer ?contadino)
                       (field ?campo1)
                       (field ?campo2)
                       (at ?contadino ?campo1)
                       (connesso ?campo1 ?campo2)
                  )
      :effect (and (not (at ?contadino ?campo1))
                 (at ?contadino ?campo2)
            )
     )
     
     ;azione per muovere un trattore da un campo ad un altro
    (:action moveTractor
    :parameters (?trattore - trattore ?contadino - contadino ?campo1 - campo ?campo2 - campo)
    :precondition (and
                       (tractor ?trattore)
                       (field ?campo1)
                       (field ?campo2)
                       (at ?trattore ?campo1)
                       (connesso ?campo1 ?campo2)
		               (farmer ?contadino)
                       (aBordo ?contadino ?trattore)
                  )
      :effect (and (not (at ?trattore ?campo1))
                 (at ?trattore ?campo2)
            )
    )
    
    ;azione per far salire un contadino a bordo di un trattore (un contadino può stare su un campo oppure su un trattore)
    (:action getOn
        :parameters (?contadino - contadino ?trattore - trattore ?campo - campo)
        :precondition (and (farmer ?contadino)
                           (tractor ?trattore)
                           (field ?campo)
                           (at ?trattore ?campo)
                           (at ?contadino ?campo)
                        )
        :effect (and (not (at ?contadino ?campo))
                     (aBordo ?contadino ?trattore)
                )
      )
      
    ;azione per far scendere un contadino dal trattore
    (:action getOff
        :parameters (?contadino - contadino ?trattore - trattore ?campo - campo)
        :precondition (and (farmer ?contadino)
                           (tractor ?trattore)
                           (field ?campo)
                           (at ?trattore ?campo)
                           (aBordo ?contadino ?trattore)
                        )
        :effect (and (at ?contadino ?campo)
                     (not (aBordo ?contadino ?trattore))
            )
    )
    ;azione per equipaggiare un trattore con un aratro
    (:action equipAratro
    :parameters (?aratro - aratro ?trattore - trattore ?contadino - contadino ?campo - campo)
    :precondition (and (plow ?aratro)
                       (tractor ?trattore)
                       (tractor-ara ?trattore)
                       (field ?campo)
                       (farmer ?contadino)
                       (not (haAttrezzo ?trattore))
                       (at ?contadino ?campo) 
                       (at ?aratro ?campo) 
                       (at ?trattore ?campo)
                  )
    :effect (and (attrezzato ?aratro ?trattore)
                 (haAttrezzo ?trattore)
                 (not (at ?aratro ?campo))
            )
    )
    
    ;azione per equipaggiare un trattore con un seminatore
    (:action equipSeminatore
    :parameters (?seminatore - seminatore ?trattore - trattore ?contadino - contadino ?campo - campo)
    :precondition (and (sower ?seminatore)
                       (tractor ?trattore)
                       (tractor-semina ?trattore)
                       (field ?campo)
                       (farmer ?contadino)
                       (not (haAttrezzo ?trattore))
                       (at ?trattore ?campo)
                       (at ?contadino ?campo) 
                       (at ?seminatore ?campo) 
                       
                  )
    :effect (and (attrezzato ?seminatore ?trattore)
                 (haAttrezzo ?trattore)
                 (not (at ?seminatore ?campo))
            )
   )
    ;azione per rimuovere un equipaggiamento da un trattore 
    (:action unequip
     :parameters (?strumento - (either seminatore aratro) ?trattore - trattore ?contadino - contadino ?campo - campo)
     :precondition (and
                       (field ?campo)
                       (farmer ?contadino)
                       (tractor ?trattore)
                       (attrezzato ?strumento ?trattore)
                       (at ?contadino ?campo)
                       (at ?trattore ?campo)
                       
                  )
     :effect (and (not (attrezzato ?strumento ?trattore))
                 (not (haAttrezzo ?trattore))
                 (at ?strumento ?campo)
            )
    )
    
    ;azione per arare un campo 
	(:action ara
	 :parameters (?trattore - trattore ?aratro - aratro ?campo - campo ?contadino - contadino)
	 :precondition (and  
	                   (field ?campo)
	                   (farmer ?contadino)
    			       (tractor ?trattore)
                       (tractor-ara ?trattore)
                       (plow ?aratro)
                       (at ?trattore ?campo)
                       (attrezzato ?aratro ?trattore)
                       (aBordo ?contadino ?trattore) 
                       
                    )
      :effect (arato ?campo)     
  )
  ;azione per seminare un campo
  (:action semina
    :parameters (?trattore - trattore ?seminatore - seminatore ?campo - campo ?contadino - contadino)
    :precondition (and  
                        (field ?campo)
                        
                        (farmer ?contadino)
                        (tractor ?trattore)
                        (tractor-semina ?trattore)
                        (sower ?seminatore)
                        (at ?trattore ?campo)
                        (attrezzato ?seminatore ?trattore)
                        (arato ?campo)
                        (aBordo ?contadino ?trattore)
                  )
    :effect (and (seminato ?campo)
                 (not (arato ?campo))
            )
  )
  ;azione per innaffiare un campo
  (:action innaffia
    :parameters (?contadino - contadino ?campo - campo)
    :precondition (and 
                       (field ?campo)
                       (farmer ?contadino)
                       (at ?contadino ?campo)
                       (seminato ?campo)
                  )
    :effect (and (annaffiato ?campo)
                 (not (seminato ?campo))
            )
  )

)

; problem
(define (problem Dieci-Campi)
  (:domain CAMPI)
  (:objects traA1 traA2 traS1 traS2 - trattore
        aratro1 aratro2 - aratro
        seminatore1 seminatore2 - seminatore
        contadino1 contadino2 - contadino
        cam1 cam2 cam3 cam4 cam5 cam6 cam7 cam8 cam9 cam10 - campo)
  (:init
   (farmer contadino1)
   (farmer contadino2)
   (field cam1)
   (field cam2)
   (field cam3)
   (field cam4)
   (field cam5)
   (field cam6)
   (field cam7)
   (field cam8)
   (field cam9)
   (field cam10)
   (tractor traA1)
   (tractor traA2)
   (tractor traS1)
   (tractor traS2)
   (tractor-ara traA1)
   (tractor-ara traA2)
   (tractor-semina traS1)
   (tractor-semina traS2)
   (plow aratro1)
   (plow aratro2)
   (sower seminatore1)
   (sower seminatore2)
   (connesso cam1 cam2)
   (connesso cam2 cam1)
   (connesso cam2 cam3)
   (connesso cam3 cam2)
   (connesso cam3 cam4)
   (connesso cam4 cam3)
   (connesso cam4 cam5)
   (connesso cam5 cam4)
   (connesso cam5 cam2)
   (connesso cam2 cam5)
   (connesso cam5 cam6)
   (connesso cam6 cam5)
   (connesso cam6 cam7)
   (connesso cam7 cam6)
   (connesso cam7 cam8)
   (connesso cam8 cam7)
   (connesso cam8 cam1)
   (connesso cam1 cam8)
   (connesso cam8 cam9)
   (connesso cam9 cam8)
   (connesso cam9 cam10)
   (connesso cam10 cam9)
   (connesso cam5 cam1)
   (connesso cam1 cam5)
   (at traA1 cam1)
   (at traA2 cam5)
   (at traS1 cam1)
   (at traS2 cam4)
   (at aratro1 cam3)
   (at aratro2 cam8)
   (at seminatore1 cam2)
   (at seminatore2 cam6)
   (at contadino1 cam1)
   (at contadino2 cam5)
   )
 
  (:goal (and
   (annaffiato cam6)
   (annaffiato cam7)
   (annaffiato cam8)
   (annaffiato cam9)
   (annaffiato cam10)
   (seminato cam1)
   (seminato cam1)
   (seminato cam2)
   (seminato cam3)
   (seminato cam4)
   (seminato cam5)))
  )

; plan
1. (movefarmer contadino2 cam5 cam2)
   deleted: (at contadino2 cam5)
   added: (at contadino2 cam2)
   goals met: 0 of 11
2. (geton contadino1 tras1 cam1)
   deleted: (at contadino1 cam1)
   added: (abordo contadino1 tras1)
   goals met: 0 of 11
3. (movetractor tras1 contadino1 cam1 cam2)
   deleted: (at tras1 cam1)
   added: (at tras1 cam2)
   goals met: 0 of 11
4. (equipseminatore seminatore1 tras1 contadino2 cam2)
   deleted: (at seminatore1 cam2)
   added: (attrezzato seminatore1 tras1) (haattrezzo tras1)
   goals met: 0 of 11
5. (movetractor tras1 contadino1 cam2 cam5)
   deleted: (at tras1 cam2)
   added: (at tras1 cam5)
   goals met: 0 of 11
6. (movetractor tras1 contadino1 cam5 cam6)
   deleted: (at tras1 cam5)
   added: (at tras1 cam6)
   goals met: 0 of 11
7. (movetractor tras1 contadino1 cam6 cam7)
   deleted: (at tras1 cam6)
   added: (at tras1 cam7)
   goals met: 0 of 11
8. (movetractor tras1 contadino1 cam7 cam8)
   deleted: (at tras1 cam7)
   added: (at tras1 cam8)
   goals met: 0 of 11
9. (movefarmer contadino2 cam2 cam5)
   deleted: (at contadino2 cam2)
   added: (at contadino2 cam5)
   goals met: 0 of 11
10. (geton contadino2 traa2 cam5)
   deleted: (at contadino2 cam5)
   added: (abordo contadino2 traa2)
   goals met: 0 of 11
11. (movetractor traa2 contadino2 cam5 cam1)
   deleted: (at traa2 cam5)
   added: (at traa2 cam1)
   goals met: 0 of 11
12. (movetractor traa2 contadino2 cam1 cam8)
   deleted: (at traa2 cam1)
   added: (at traa2 cam8)
   goals met: 0 of 11
13. (getoff contadino1 tras1 cam8)
   deleted: (abordo contadino1 tras1)
   added: (at contadino1 cam8)
   goals met: 0 of 11
14. (equiparatro aratro2 traa2 contadino1 cam8)
   deleted: (at aratro2 cam8)
   added: (attrezzato aratro2 traa2) (haattrezzo traa2)
   goals met: 0 of 11
15. (ara traa2 aratro2 cam8 contadino2)
   added: (arato cam8)
   goals met: 0 of 11
16. (getoff contadino2 traa2 cam8)
   deleted: (abordo contadino2 traa2)
   added: (at contadino2 cam8)
   goals met: 0 of 11
17. (geton contadino2 tras1 cam8)
   deleted: (at contadino2 cam8)
   added: (abordo contadino2 tras1)
   goals met: 0 of 11
18. (semina tras1 seminatore1 cam8 contadino2)
   deleted: (arato cam8)
   added: (seminato cam8)
   goals met: 0 of 11
19. (innaffia contadino1 cam8)
   deleted: (seminato cam8)
   added: (annaffiato cam8)
   goals met: 1 of 11
20. (movetractor tras1 contadino2 cam8 cam9)
   deleted: (at tras1 cam8)
   added: (at tras1 cam9)
   goals met: 1 of 11
21. (geton contadino1 traa2 cam8)
   deleted: (at contadino1 cam8)
   added: (abordo contadino1 traa2)
   goals met: 1 of 11
22. (movetractor traa2 contadino1 cam8 cam9)
   deleted: (at traa2 cam8)
   added: (at traa2 cam9)
   goals met: 1 of 11
23. (ara traa2 aratro2 cam9 contadino1)
   added: (arato cam9)
   goals met: 1 of 11
24. (semina tras1 seminatore1 cam9 contadino2)
   deleted: (arato cam9)
   added: (seminato cam9)
   goals met: 1 of 11
25. (getoff contadino2 tras1 cam9)
   deleted: (abordo contadino2 tras1)
   added: (at contadino2 cam9)
   goals met: 1 of 11
26. (innaffia contadino2 cam9)
   deleted: (seminato cam9)
   added: (annaffiato cam9)
   goals met: 2 of 11
27. (movetractor traa2 contadino1 cam9 cam8)
   deleted: (at traa2 cam9)
   added: (at traa2 cam8)
   goals met: 2 of 11
28. (movetractor traa2 contadino1 cam8 cam7)
   deleted: (at traa2 cam8)
   added: (at traa2 cam7)
   goals met: 2 of 11
29. (ara traa2 aratro2 cam7 contadino1)
   added: (arato cam7)
   goals met: 2 of 11
30. (geton contadino2 tras1 cam9)
   deleted: (at contadino2 cam9)
   added: (abordo contadino2 tras1)
   goals met: 2 of 11
31. (movetractor tras1 contadino2 cam9 cam8)
   deleted: (at tras1 cam9)
   added: (at tras1 cam8)
   goals met: 2 of 11
32. (movetractor tras1 contadino2 cam8 cam7)
   deleted: (at tras1 cam8)
   added: (at tras1 cam7)
   goals met: 2 of 11
33. (semina tras1 seminatore1 cam7 contadino2)
   deleted: (arato cam7)
   added: (seminato cam7)
   goals met: 2 of 11
34. (getoff contadino2 tras1 cam7)
   deleted: (abordo contadino2 tras1)
   added: (at contadino2 cam7)
   goals met: 2 of 11
35. (innaffia contadino2 cam7)
   deleted: (seminato cam7)
   added: (annaffiato cam7)
   goals met: 3 of 11
36. (movetractor traa2 contadino1 cam7 cam6)
   deleted: (at traa2 cam7)
   added: (at traa2 cam6)
   goals met: 3 of 11
37. (ara traa2 aratro2 cam6 contadino1)
   added: (arato cam6)
   goals met: 3 of 11
38. (geton contadino2 tras1 cam7)
   deleted: (at contadino2 cam7)
   added: (abordo contadino2 tras1)
   goals met: 3 of 11
39. (movetractor tras1 contadino2 cam7 cam6)
   deleted: (at tras1 cam7)
   added: (at tras1 cam6)
   goals met: 3 of 11
40. (semina tras1 seminatore1 cam6 contadino2)
   deleted: (arato cam6)
   added: (seminato cam6)
   goals met: 3 of 11
41. (getoff contadino2 tras1 cam6)
   deleted: (abordo contadino2 tras1)
   added: (at contadino2 cam6)
   goals met: 3 of 11
42. (innaffia contadino2 cam6)
   deleted: (seminato cam6)
   added: (annaffiato cam6)
   goals met: 4 of 11
43. (movetractor traa2 contadino1 cam6 cam5)
   deleted: (at traa2 cam6)
   added: (at traa2 cam5)
   goals met: 4 of 11
44. (ara traa2 aratro2 cam5 contadino1)
   added: (arato cam5)
   goals met: 4 of 11
45. (geton contadino2 tras1 cam6)
   deleted: (at contadino2 cam6)
   added: (abordo contadino2 tras1)
   goals met: 4 of 11
46. (movetractor tras1 contadino2 cam6 cam5)
   deleted: (at tras1 cam6)
   added: (at tras1 cam5)
   goals met: 4 of 11
47. (semina tras1 seminatore1 cam5 contadino2)
   deleted: (arato cam5)
   added: (seminato cam5)
   goals met: 5 of 11
48. (movetractor tras1 contadino2 cam5 cam4)
   deleted: (at tras1 cam5)
   added: (at tras1 cam4)
   goals met: 5 of 11
49. (movetractor traa2 contadino1 cam5 cam4)
   deleted: (at traa2 cam5)
   added: (at traa2 cam4)
   goals met: 5 of 11
50. (ara traa2 aratro2 cam4 contadino1)
   added: (arato cam4)
   goals met: 5 of 11
51. (semina tras1 seminatore1 cam4 contadino2)
   deleted: (arato cam4)
   added: (seminato cam4)
   goals met: 6 of 11
52. (movetractor tras1 contadino2 cam4 cam3)
   deleted: (at tras1 cam4)
   added: (at tras1 cam3)
   goals met: 6 of 11
53. (movetractor traa2 contadino1 cam4 cam3)
   deleted: (at traa2 cam4)
   added: (at traa2 cam3)
   goals met: 6 of 11
54. (ara traa2 aratro2 cam3 contadino1)
   added: (arato cam3)
   goals met: 6 of 11
55. (semina tras1 seminatore1 cam3 contadino2)
   deleted: (arato cam3)
   added: (seminato cam3)
   goals met: 7 of 11
56. (movetractor tras1 contadino2 cam3 cam2)
   deleted: (at tras1 cam3)
   added: (at tras1 cam2)
   goals met: 7 of 11
57. (movetractor traa2 contadino1 cam3 cam2)
   deleted: (at traa2 cam3)
   added: (at traa2 cam2)
   goals met: 7 of 11
58. (ara traa2 aratro2 cam2 contadino1)
   added: (arato cam2)
   goals met: 7 of 11
59. (semina tras1 seminatore1 cam2 contadino2)
   deleted: (arato cam2)
   added: (seminato cam2)
   goals met: 8 of 11
60. (movetractor tras1 contadino2 cam2 cam1)
   deleted: (at tras1 cam2)
   added: (at tras1 cam1)
   goals met: 8 of 11
61. (movetractor traa2 contadino1 cam2 cam1)
   deleted: (at traa2 cam2)
   added: (at traa2 cam1)
   goals met: 8 of 11
62. (ara traa2 aratro2 cam1 contadino1)
   added: (arato cam1)
   goals met: 8 of 11
63. (semina tras1 seminatore1 cam1 contadino2)
   deleted: (arato cam1)
   added: (seminato cam1)
   goals met: 10 of 11
64. (movetractor tras1 contadino2 cam1 cam8)
   deleted: (at tras1 cam1)
   added: (at tras1 cam8)
   goals met: 10 of 11
65. (movetractor tras1 contadino2 cam8 cam9)
   deleted: (at tras1 cam8)
   added: (at tras1 cam9)
   goals met: 10 of 11
66. (movetractor tras1 contadino2 cam9 cam10)
   deleted: (at tras1 cam9)
   added: (at tras1 cam10)
   goals met: 10 of 11
67. (movetractor traa2 contadino1 cam1 cam8)
   deleted: (at traa2 cam1)
   added: (at traa2 cam8)
   goals met: 10 of 11
68. (movetractor traa2 contadino1 cam8 cam9)
   deleted: (at traa2 cam8)
   added: (at traa2 cam9)
   goals met: 10 of 11
69. (movetractor traa2 contadino1 cam9 cam10)
   deleted: (at traa2 cam9)
   added: (at traa2 cam10)
   goals met: 10 of 11
70. (ara traa2 aratro2 cam10 contadino1)
   added: (arato cam10)
   goals met: 10 of 11
71. (semina tras1 seminatore1 cam10 contadino2)
   deleted: (arato cam10)
   added: (seminato cam10)
   goals met: 10 of 11
72. (getoff contadino2 tras1 cam10)
   deleted: (abordo contadino2 tras1)
   added: (at contadino2 cam10)
   goals met: 10 of 11
73. (innaffia contadino2 cam10)
   deleted: (seminato cam10)
   added: (annaffiato cam10)
   goals met: 11 of 11
